/*:
 ![Make School Banner](./swift_banner.png)
 # ディクショナリとオプションの拡張チャレンジ
 
 ## より堅牢な連絡先
 
 この練習では、前回の課題コードを拡張してもっと堅牢にします。
 
 ### 延長チャレンジ
 
 基本のコードが手に入ったので、「リファクタリング」します！
 
 1. `ContactBook`クラスを作成します。 `addContact`、`findContact`、`updateContact`、`deleteContact`、`allContacts`の各メソッドなど、以前の課題と同じ機能を持っています。
 1. `ContactDetails`クラスを作成します。 値をこのクラスで置き換え、メソッドを適宜更新します。 出力したものを更新して、意味が通じるようにします。 これは自由な形式にしますが、次のようなその他の値も考慮する必要があります。 電話、携帯電話、電子メール、Facebookプロファイル、LinkedInプロファイル。 これらを保存するにはどうしたらいいのでしょうか？ オプショナルを使用した方が良いかもしれませんね... ヒントです ;)
 1. `ContactBook`オブジェクトをいくつか作成して、これらにデータを追加します。 テストしてみましょう！
 
 - callout(追加の課題): `ContactBook`にお気に入りの連絡先機能を実装してください。 これらの連絡先は通常のメソッドからアクセスできるはずですが、お気に入りの連絡先だけを出力する新しい`favoriteContacts`メソッドも取り入れましょう！
 
 */













/*:
 [前へ](@previous)
 */
